app/Controllers/Auth.php

    public function process()
{
    $username = trim($this->request->getPost('username'));
    $password = trim($this->request->getPost('password'));

    $userModel     = new UserModel();
    $employeeModel = new EmployeeModel();

    // ===== CEK TABEL USERS =====
    $user = $userModel->where('username', $username)->first();
    if ($user) {
        if (!password_verify($password, $user['password_hash'])) {
            return redirect()->back()->with('error', 'Username atau password salah');
        }

        session()->set([
            'user_id'     => $user['user_id'],
            'employee_id' => $user['employee_id'] ?? null,
            'username'    => $user['username'],
            'role'        => strtolower($user['role']),
            'logged_in'   => true
        ]);
        session()->regenerate(true);

        return $this->redirectByRole(strtolower($user['role']));
    }

    // ===== CEK TABEL EMPLOYEES =====
    $employee = $employeeModel->where('employee_nik', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'EMP001'
 LIMIT 1
SELECT *
FROM `employees`
WHERE `employee_nik` = 'EMP001'
 LIMIT 1