app/Controllers/karyawan/MedicalClaimController.php

SELECT *
FROM `employees`
WHERE `employees`.`employee_id` = '1'
SELECT *
FROM `claim_limits`
WHERE `employee_id` = '1'
AND `year` = '2026'
 LIMIT 1
SELECT *
FROM `medical_claims`
WHERE `employee_id` = '1'
ORDER BY `claim_date` DESC
SELECT *
FROM `dependents`
WHERE `employee_id` = '1'
---
    public function index()
    {
        $employeeId = session('employee_id');
        if (!$employeeId) return redirect()->to('/login');

        $year = date('Y');
        $limitModel     = new ClaimLimitModel();
        $claimModel     = new MedicalClaimModel();
        $dependentModel = new DependentModel();
        $employeeModel  = new EmployeeModel();

        $employee = $employeeModel->find($employeeId);
        if (!$employee) return "Data profil karyawan tidak ditemukan.";

        $limit = $limitModel->where(['employee_id' => $employeeId, 'year' => $year])->first();
        $claims = $claimModel->where('employee_id', $employeeId)->orderBy('claim_date', 'DESC')->findAll();

        return view('karyawan/employee/dashboard', [
            'employee'   => $employee,
            'dependents' => $dependentModel->where('employee_id', $employeeId)->findAll(),

SELECT *
FROM `dependents`
WHERE `employee_id` = '1'
---
    public function create()
    {
        $employeeId = session('employee_id');
        $dependentModel = new DependentModel();
        return view('karyawan/karyawan/ajukan_klaim', [
            'dependents' => $dependentModel->where('employee_id', $employeeId)->findAll()
        ]);