app/Controllers/karyawan/ProfileController.php

SELECT *
FROM `employees`
WHERE `employees`.`employee_id` = '1'
---
    public function index()
    {
        if (!session('logged_in')) {
            return redirect()->to('/login');
        }

        $employeeModel = new EmployeeModel();
        $userModel = new UserModel();

        $employee = $employeeModel->find(session('employee_id'));